chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/processor/usb_p32mx130f064b.h
PLIB_INLINE SFR_DATA _USB_EP10_HANDSHAKE_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP10_EPHSHK_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP11_CONTROL_OFF_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP11_EPCONDIS_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP11_RCV_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP11_EPRXEN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP11_XMIT_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP11_EPTXEN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP11_STALL_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP11_EPSTALL_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP11_HANDSHAKE_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP11_EPHSHK_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP12_CONTROL_OFF_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP12_EPCONDIS_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP12_RCV_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP12_EPRXEN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP12_XMIT_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP12_EPTXEN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP12_STALL_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP12_EPSTALL_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP12_HANDSHAKE_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP12_EPHSHK_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP13_CONTROL_OFF_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP13_EPCONDIS_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP13_RCV_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP13_EPRXEN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP13_XMIT_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP13_EPTXEN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP13_STALL_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP13_EPSTALL_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP13_HANDSHAKE_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP13_EPHSHK_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP14_CONTROL_OFF_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP14_EPCONDIS_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP14_RCV_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP14_EPRXEN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP14_XMIT_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP14_EPTXEN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP14_STALL_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP14_EPSTALL_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP14_HANDSHAKE_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP14_EPHSHK_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP15_CONTROL_OFF_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP15_EPCONDIS_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP15_RCV_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP15_EPRXEN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP15_XMIT_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP15_EPTXEN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP15_STALL_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP15_EPSTALL_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP15_HANDSHAKE_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP15_EPHSHK_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

